<!-- 用户注册协议 -->
<template lang="html">
  <div class="Agreement">
    <WorkHeader>
      <p>注册协议</p>
    </WorkHeader>
    <span class="title">北京犀牛小哥科技有限公司科技（以下简称为 “犀牛小哥”）依据本协议的规定为用户提供服务，本协议在用户和犀牛小哥之间具有合同法上的法律效力，犀牛小哥在此特别提醒用户认真阅读、充分理解本协议各条款，特别是其中所涉及的免除及限制犀牛小哥责任的条款、对用户的权利限制条款等。用户注册即等于同意本协议，本协议即构成对双方有约束力的法律文件。</span>
    <p v-for="(agree,index) in agreeList">
      <span class="title">第{{agree.num}}条&nbsp;&nbsp;&nbsp;{{agree.title}}</span>
      <span class="title" style="marginTop:1rem;" v-if="agree.titlecon!=null">{{agree.titlecon}}</span>
      <span class="title_con" v-for="agreeCon in agree.childred">{{agreeCon.num}}&nbsp;&nbsp;&nbsp;{{agreeCon.con}}<br>
        <span v-for="agreechild in agreeCon.children">({{agreechild.num}})&nbsp;&nbsp;{{agreechild.con}}</span>
      </span>
    </p>
  </div>
</template>

<script>
import WorkHeader from '@/components/work_header'
export default {
  components:{
    WorkHeader,
  },
  data(){
    return{
      agreeList:[
        {
          num:'1',
          title:'犀牛小哥服务条款的确认和接纳',
          childred:[
            {
              num:'1.1',
              con:'犀牛小哥的各项电子服务和项目以及个人信息的所有权和运作权归犀牛小哥所有。用户同意所有注册协议条款并完成注册程序，才能成为犀牛小哥的正式用户。用户确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。'
            },
            {
              num:'1.2',
              con:'用户点击同意本协议的，即视为用户确认自己具有享受犀牛小哥服务等相应的权利能力和行为能力，能够独立承担法律责任。'
            },
            {
              num:'1.3',
              con:'犀牛小哥保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消项目相关状态的权利。'
            }
          ]
        },
        {
          num:'2',
          title:'犀牛小哥服务',
          childred:[
            {
              num:'2.1',
              con:'犀牛小哥通过犀牛小哥平台依法为用户提供互联网信息等服务，用户在完全同意本协议及犀牛小哥平台规则的情况下，方有权使用犀牛小哥的相关服务。'
            },
            {
              num:'2.2',
              con:'用户必须自行准备如下设备和承担如下开支：',
              children:[
                {
                  num:'1',
                  con:'上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；'
                },
                {
                  num:'2',
                  con:'上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。'
                }
              ]
            }
          ]
        },
        {
          num:'3',
          title:'用户信息',
          childred:[
            {
              num:'3.1',
              con:'用户应自行向犀牛小哥提供注册资料，用户所提供的注册资料应真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且犀牛小哥保留终止用户使用犀牛小哥平台各项服务的权利。'
            },
            {
              num:'3.2',
              con:'用户在犀牛小哥平台进行浏览、接单、发单等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，犀牛小哥将予以严格保密，除非得到用户的授权或法律另有规定，犀牛小哥不会向外界披露用户隐私信息。'
            },
            {
              num:'3.3',
              con:'用户注册成功后，将产生用户名和密码等账户信息，用户可以根据犀牛小哥规定改变用户的密码。用户应谨慎合理的保存、使用其用户名和密码。用户若发现任何非法使用用户账号或存在安全漏洞的情况，请立即通知犀牛小哥并向公安机关报案。'
            },
            {
              num:'3.4',
              con:'用户同意，犀牛小哥拥有通过邮件、微信、短信、电话等形式，向用户或用户提供的联系人等发送活动信息、通知推送等告知信息的权利。'
            },
            {
              num:'3.5',
              con:'用户不得将在犀牛小哥平台注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。'
            },
            {
              num:'3.6',
              con:'用户同意，犀牛小哥有权使用用户的注册信息、名称、密码等信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。'
            }
          ]
        },
        {
          num:'4',
          title:'用户的依法言行义务',
          childred:[
            {
              num:'4.1',
              con:'本协议依据国家相关法律法规规章制定，用户同意严格遵守以下义务：',
              children:[
                {
                  num:'1',
                  con:'不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；'
                },
                {
                  num:'2',
                  con:'从中国大陆向境外传输资料信息时必须符合中国有关法规；'
                },
                {
                  num:'3',
                  con:'不得利用犀牛小哥平台从事窃取商业秘密、窃取个人信息等违法犯罪活动；'
                },
                {
                  num:'4',
                  con:'不得干扰犀牛小哥平台的正常运转，不得侵入犀牛小哥平台系统；'
                },
                {
                  num:'5',
                  con:'不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、不文明的等信息资料；'
                },
                {
                  num:'6',
                  con:'不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；'
                },
                {
                  num:'7',
                  con:'不得教唆他人从事本条所禁止的行为；'
                },
                {
                  num:'8',
                  con:'不得利用在犀牛小哥平台注册的账户进行牟利性经营活动；'
                },
                {
                  num:'9',
                  con:'不得发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容； 用户应不时关注并遵守犀牛小哥不时公布或修改的各类合法规则规定。 犀牛小哥保有删除各类不符合法律政策或不真实的信息内容而无须通知用户的权利。 若用户未遵守以上规定的，犀牛小哥有权作出独立判断并采取暂停或关闭用户帐号等措施。用户须对自己在网上的言论和行为承担法律责任。'
                }
              ]
            }
          ]
        },
        {
          num:'5',
          title:'项目信息',
          titlecon:'犀牛小哥平台上的项目价格等项目信息随时都有可能发生变动，犀牛小哥不作特别通知。由于犀牛小哥平台上项目信息的数量极其庞大，虽然犀牛小哥会尽最大努力保证用户所浏览项目信息的准确性，但由于众所周知的互联网技术因素等客观原因存在，犀牛小哥平台显示的信息可能会有一定的滞后性或差错，对此情形用户知悉并理解；犀牛小哥欢迎纠错，并会视情况给予纠错者一定的奖励。'
        },
        {
          num:'6',
          title:'发单',
          childred:[
            {
              num:'6.1',
              con:'在用户发单时，请用户仔细确认犀牛小哥平台上的项目信息的名称、报价、描述、时间限制、联系地址、电话、联系人等信息。联系人有误的，联系人的行为和意思表示视为用户的行为和意思表示，用户应对联系人的行为及意思表示的法律后果承担连带责任。'
            },
            {
              num:'6.2',
              con:'除法律另有强制性规定外，双方约定如下：接单人平台上接单方展示的项目和报价等信息仅仅是要约邀请，用户接单之后，系统生成的项目信息是计算机信息系统根据用户操作的内容自动生成的数据，仅是用户向发单方发出的合同要约；发单方和平台收到该信息后，审核确认其用户信息，并达成合作，方视为用户与发单方之间就接单的项目建立了合同关系；'
            },
            {
              num:'6.3',
              con:'由于市场变化及各种以合理商业努力难以控制的因素的影响，犀牛小哥无法保证用户提交的项目信息中都会有人接单。'
            }
          ]
        },
        {
          num:'7',
          title:'信息确认',
          childred:[
            {
              num:'7.1',
              con:'因如下情况造成信息延迟或无法服务等，平台方不承担相关责任：',
              children:[
                {
                  num:'1',
                  con:'用户提供的信息错误、地址不详细等原因导致的；'
                },
                {
                  num:'2',
                  con:'情势变更因素导致的；'
                },
                {
                  num:'3',
                  con:'不可抗力因素导致的，例如：自然灾害、交通戒严、突发战争等。'
                }
              ]
            }
          ]
        },
        {
          num:'8',
          title:'所有权及知识产权条款',
          childred:[
            {
              num:'8.1',
              con:'用户一旦接受本协议，即表明该用户主动将其在任何时间段在犀牛小哥平台发表的任何形式的信息内容的财产性权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给犀牛小哥所有，用户同意犀牛小哥有权就任何主体侵权而单独提起诉讼。'
            },
            {
              num:'8.2',
              con:'本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权转让书面协议，其效力及于用户在犀牛小哥平台上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。'
            },
            {
              num:'8.3',
              con:'用户同意并已充分了解本协议的条款，承诺不将已发表于犀牛小哥平台的信息，以任何形式发布或授权其它主体以任何方式使用（包括但限于在各类平台、媒体上使用）。'
            },
            {
              num:'8.4',
              con:'犀牛小哥对犀牛小哥平台内容及资源的著作权等合法权利,受国家法律保护,有权对本协议及犀牛小哥平台内容进行修改，并在犀牛小哥平台张贴，无须另行通知用户。在法律允许的最大限度范围内，犀牛小哥对本协议及犀牛小哥平台内容拥有解释权。'
            },
            {
              num:'8.5',
              con:'除法律另有强制性规定外，未经犀牛小哥明确的特别书面许可,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用犀牛小哥平台的信息内容，否则，犀牛小哥有权追究其法律责任。'
            },
            {
              num:'8.6',
              con:'犀牛小哥平台所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是犀牛小哥或其内容提供者的财产，受中国和国际版权法的保护。犀牛小哥平台上所有内容的汇编是犀牛小哥的排他财产，受中国和国际版权法的保护。犀牛小哥平台上所有软件都是犀牛小哥或其软件供应商的财产，受中国和国际版权法的保护。'
            }
          ]
        },
        {
          num:'9',
          title:'责任限制及不承诺担保',
          titlecon:'除非另有明确的书面说明, 犀牛小哥及其所包含的或以其它方式通过犀牛小哥平台提供给用户的全部信息、内容、材料、产品（包括软件）和服务，均是在"按现状"和"按现有"的基础上提供的。 除非另有明确的书面说明, 犀牛小哥不对犀牛小哥平台的运营及其包含在犀牛小哥平台上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。 犀牛小哥不担保犀牛小哥平台所包含的或以其它方式通过犀牛小哥平台提供给用户的全部信息、内容、材料、产品（包括软件）和服务、其服务器或从犀牛小哥发出的电子信件、信息没有病毒或其他有害成分。 如因不可抗力或其它犀牛小哥无法控制的原因使犀牛小哥平台系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，犀牛小哥会合理地尽力协助处理善后事宜。'
        },
        {
          num:'10',
          title:'协议更新及用户关注义务',
          titlecon:'根据国家法律法规变化及犀牛小哥平台运营需要，犀牛小哥有权对本协议及用户与犀牛小哥之间签订的其他协议条款不时地进行修改，修改后的协议一旦被张贴在犀牛小哥平台上即生效，并代替原来的协议。用户可随时登陆查阅最新协议；用户有义务不时关注并阅读最新版的协议及平台公告。如用户不同意更新后的协议，可以且应立即停止接受犀牛小哥平台依据本协议提供的服务；如用户继续使用犀牛小哥平台提供的服务的，即视为同意更新后的协议。犀牛小哥建议用户在使用犀牛小哥平台之前阅读本协议及犀牛小哥的公告。 如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。'
        },
        {
          num:'11',
          title:'法律管辖和适用',
          titlecon:'本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。 如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。 如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向协议签约地人民法院提起诉讼。'
        },
        {
          num:'12',
          title:'其他',
          childred:[
            {
              num:'12.1',
              con:'犀牛小哥尊重用户的合法权利，本协议及犀牛小哥平台上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户提供服务。犀牛小哥欢迎用户提出意见和建议，犀牛小哥将虚心接受并适时修改本协议及犀牛小哥上的各类规则。'
            }
          ]
        }
      ]
    }
  }
}
</script>

<style lang="scss" scoped>
.Agreement{
  width: 100%;
  padding-top:  5rem;
  .title{
    display: inline-block;
    font-size: 1.5rem;
    font-weight: bold;
    width: 100%;
    box-sizing: border-box;
    padding-left: 5%;
    margin-top: 2rem;
  }
  .title_con{
    font-size:1.4rem;
    width: 100%;
    box-sizing: border-box;
    padding-left: 8%;
    padding-right: 2%;
    margin-top: 1rem;
    text-align: justify;
    span{
      display: inline-block;
      width: 100%;
      box-sizing: border-box;
      padding-left: 5%;
      margin-top: 1rem;
      text-align: justify;
    }
  }
}
</style>
